app/Http/Controllers/CategoryController.php

    public function index()
    {
        $title = "categories";
        $categories = Category::get();
---
select * from `categories`