app/Http/Controllers/DashboardController.php

    public function index(){
        $title = "dashboard";

        $total_purchases = Purchase::where('expiry_date','=',Carbon::now())->count();
        $total_categories = Category::count();
        $total_suppliers = Supplier::count();
        $total_sales = Sales::count();

        $pieChart = app()->chartjs
                ->name('pieChart')
                ->type('pie')
                ->size(['width' => 400, 'height' => 200])
                ->labels(['Total Purchases', 'Total Suppliers','Total Sales'])
                ->datasets([
                    [
                        'backgroundColor' => ['#FF6384', '#36A2EB','#7bb13c'],
                        'hoverBackgroundColor' => ['#FF6384', '#36A2EB','#7bb13c'],
                        'data' => [$total_purchases, $total_suppliers,$total_sales]
                    ]
                ])
                ->options([]);



        $total_expired_products = Purchase::whereDate('expiry_date', '=', Carbon::now())->count();
        $latest_sales = Sales::whereDate('created_at','=',Carbon::now())->get();
        $today_sales = Sales::whereDate('created_at','=',Carbon::now())->sum('total_price');
---
select count(*) as aggregate from `purchases` where `expiry_date` = '2024-04-16 15:27:20'
select count(*) as aggregate from `categories`
select count(*) as aggregate from `suppliers` where `suppliers`.`deleted_at` is null
select count(*) as aggregate from `sales` where `sales`.`deleted_at` is null
select count(*) as aggregate from `purchases` where date(`expiry_date`) = '2024-04-16'
select * from `sales` where date(`created_at`) = '2024-04-16' and `sales`.`deleted_at` is null
select sum(`total_price`) as aggregate from `sales` where date(`created_at`) = '2024-04-16' and `sales`.`deleted_at` is null