app/Http/Controllers/ProductController.php

    public function index()
    {
        $title = "products";
        $products = Product::with('purchase')->get();
---
select * from `products` where `products`.`deleted_at` is null
select * from `purchases` where `purchases`.`id` in (1)