app/Http/Controllers/UserController.php

select * from `users`
select * from `roles`
---
    public function index()
    {
        $title = "users";
        $users  = User::with('roles')->get();
        $roles = Role::get();

select * from `roles`
---
    public function profile()
    {
        $title = "profile";
        $roles = Role::get();